<script setup lang="ts"></script>
<template>
  <v-container>
    <v-row class="d-flex justify-center">
      <v-col cols="12" md="8">
        <BackButton />
        <h1>
          Согласие на обработку персональных данных
        </h1>
        <p>
          Настоящим я даю согласие ООО "Анкиал" (далее — Оператор), на обработку моих персональных данных, а именно:
          фамилии,
          имени, номера контактного телефона, путём их передачи в защищённый Telegram-чат, доступ к которому имеют
          исключительно уполномоченные представители Оператора (администраторы заведения).
        </p>
        <br>
        <p>
          Обработка персональных данных осуществляется с целью обработки моего запроса/бронирования и дальнейшего
          взаимодействия со мной по указанному вопросу.
        </p>
        <br>
        <p>
          Я понимаю, что мои данные не подлежат передаче третьим лицам, кроме указанных администраторов, и будут
          использоваться только в рамках указанной цели.
        </p>
        <br>
        <p>
          Согласие дано на срок, необходимый для достижения цели обработки, но не более чем до момента отзыва согласия.
          Отзыв согласия может быть осуществлён мною в любой момент путём направления письменного заявления Оператору.
        </p>
        <br>
        <p>
          Настоящее согласие составлено в соответствии с требованиями Федерального закона от 27.07.2006 № 152-ФЗ «О
          персональных данных».
        </p>
      </v-col>
    </v-row>
  </v-container>
</template>